hop-in/app/views/vehicles/index.html.erb

	<article class="vehicle-container">
		<h2><%= vehicle.owner.first_name %> - <%= vehicle.vehicle_year %> <%= vehicle.vehicle_make %> <%= vehicle.vehicle_model %></h2>
---
SELECT "vehicles".* FROM "vehicles" WHERE ((((city ILIKE '%tor%') OR (vehicle_make ILIKE '%tor%')) OR (vehicle_model ILIKE '%tor%')) OR (province ILIKE '%tor%'))