hop-in/app/views/vehicles/show.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."vehicle_id" = ?  [["vehicle_id", 1]]
---
    <h2>Vehicle Reservations</h2>
    <% @vehicle.reservations.each do |reservation| %>