hop-in/app/views/reservations/index.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."vehicle_id" = ?  [["vehicle_id", 1]]
---
<% if current_user == @vehicle.owner %>
  <% @vehicle.reservations.each do |reservation| %>