hop-in/app/controllers/availabilities_controller.rb

SELECT "availabilities".* FROM "availabilities"
---
	def index
		@availabilities = Availability.all

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def new
		@availability = Availability.new
		@vehicle = Vehicle.find(params[:vehicle_id])

SELECT  "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
	def show
		@availability = Availability.find(params[:id])
		@vehicle = Vehicle.find(params[:vehicle_id])

SELECT  "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@availability = Availability.find(params[:id])
    @vehicle = Vehicle.find(params[:vehicle_id])

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."vehicle_id" = $1  [["vehicle_id", 11]]
INSERT INTO "availabilities" ("start_time", "end_time", "weekday", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_time", 800], ["end_time", 1400], ["weekday", "Monday"], ["vehicle_id", 1], ["created_at", 2017-01-04 20:57:18 UTC], ["updated_at", 2017-01-04 20:57:18 UTC]]
---
	def create
		@availability = Availability.new(availability_params)
    @availability.vehicle = Vehicle.find(params[:vehicle_id])

    if @availability.save

SELECT  "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "availabilities" SET "start_time" = $1, "end_time" = $2, "updated_at" = $3 WHERE "availabilities"."id" = $4  [["start_time", 800], ["end_time", 1200], ["updated_at", 2017-01-05 18:51:52 UTC], ["id", 1]]
---
	def update
		@availability = Availability.find(params[:id])
    @availability.vehicle = Vehicle.find(params[:vehicle_id])

		if @availability.update_attributes(availability_params)

SELECT  "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "availabilities" WHERE "availabilities"."id" = $1  [["id", 3]]
---
	def destroy
		@availability = Availability.find(params[:id])
		@availability.destroy

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def load_vehicle
		@vehicle = Vehicle.find(params[:vehicle_id])