hop-in/app/controllers/reservations_controller.rb

	def new
		@reservation = Reservation.new
		@vehicle = Vehicle.find(params[:vehicle_id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def show
		@reservation = Reservation.find(params[:id])
		@vehicle = Vehicle.find(params[:vehicle_id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def edit
		@reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@reservation = Reservation.new(reservation_params)
    @reservation.start_time = DateTime.new(params[:date][:year].to_i, params[:date][:month].to_i, params[:date][:day].to_i, params[:date][:hour].to_i, params[:date][:minute].to_i, 0, "-05:00")
    @reservation.end_time = @reservation.start_time + 1.hour
    @reservation.vehicle = Vehicle.find(params[:vehicle_id])
		@reservation.passenger = current_user

		if @vehicle.capacity(reservation_params[:seats].to_i, params[:vehicle_id]) #&& @vehicle.available(params[:vehicle_id].to_i, reservation_params[:start_time])
      if @reservation.save
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."vehicle_id" = ?  [["vehicle_id", 1]]
INSERT INTO "reservations" ("passenger_id", "vehicle_id", "start_time", "start_location", "destination", "created_at", "updated_at", "seats", "end_time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def update
		@reservation = Reservation.find(params[:id])
    @reservation.start_time = DateTime.new(params[:date][:year].to_i, params[:date][:month].to_i, params[:date][:day].to_i, params[:date][:hour].to_i, params[:date][:minute].to_i)
    @reservation.end_time = @reservation.start_time + 1.hour
    @reservation.vehicle = Vehicle.find_by(params[:vehicle_id])

    if @vehicle.capacity(reservation_params[:seats].to_i, params[:vehicle_id].to_i)
  		if @reservation.update_attributes(reservation_params)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."vehicle_id" = ?  [["vehicle_id", 1]]
UPDATE "reservations" SET "start_time" = $1, "end_time" = $2, "destination" = $3, "updated_at" = $4 WHERE "reservations"."id" = $5  [["start_time", 2017-01-05 16:56:00 UTC], ["end_time", 2017-01-05 17:56:00 UTC], ["destination", "1572 Kerns Rd, Burlington, ON"], ["updated_at", 2017-01-04 18:56:25 UTC], ["id", 1]]

	def destroy
		@reservation = Reservation.find(params[:id])
		@reservation.destroy
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]

	def load_vehicle
		@vehicle = Vehicle.find(params[:vehicle_id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]