hop-in/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tsmith@email.com"], ["LIMIT", 1]]
---
	def create
		user = User.find_by(email: session_params[:email])