hop-in/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "phone_number", "email", "date_of_birth", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.date_of_birth = Date.new(params[:date][:year].to_i, params[:date][:day].to_i, params[:date][:month].to_i)
    if @user.save