hop-in/app/controllers/vehicles_controller.rb

	def index
		@vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles" WHERE ((((city ILIKE '%tor%') OR (vehicle_make ILIKE '%tor%')) OR (vehicle_model ILIKE '%tor%')) OR (province ILIKE '%tor%'))

	def create
		@vehicle = Vehicle.new(vehicle_params)
		@vehicle.owner_id = current_user.id

		if @vehicle.save
      Availability.create(start_time: 0, end_time: 0, weekday: 'Monday', vehicle_id: @vehicle.id)
---
INSERT INTO "vehicles" ("vehicle_year", "vehicle_make", "vehicle_model", "street_address", "city", "province", "postal_code", "owner_id", "created_at", "updated_at", "seats") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "availabilities" ("start_time", "end_time", "weekday", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_time", 0], ["end_time", 0], ["weekday", "Monday"], ["vehicle_id", 10], ["created_at", 2017-01-06 01:54:41 UTC], ["updated_at", 2017-01-06 01:54:41 UTC]]

	def show
		@vehicle = Vehicle.find(params[:id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@vehicle = Vehicle.find(params[:id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@vehicle = Vehicle.find(params[:id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def destroy
		@vehicle = Vehicle.find(params[:id])
		@vehicle.destroy
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 1]]